In [6]:
import pandas as pd
from datetime import datetime

In [2]:
# note: python is case-sensitive
# Pandas is not the same as pandas
# DateTime is not the same as datetime

In [4]:
My_List = [1, 2, 3, 4, 5]
My_df = pd.DataFrame(My_List, columns=['Numbers'])

In [5]:
print(My_df)

   Numbers
0        1
1        2
2        3
3        4
4        5

In [9]:
# PATIENT table
patient_data = [
    ['1', 'John', 'A', 'Smith', '1952-01-01', '1206 Fox Hollow Rd.', 'Pittsburgh', 'PA', '15213', '6789871234', 'M'],
    ['2', 'Candice', 'P', 'Jones', '1978-02-03', '1429 Orlyn Dr.', 'Los Angeles', 'CA', '90024', '3107381419', 'F'],
    ['3', 'Regina', 'H', 'Wilson', '1985-04-23', '765 Chestnut Ln.', 'Albany', 'NY', '12065', '5184590206', 'F'],
    ['4', 'Harold', '', 'Lee', '1966-11-15', '2928 Policy St.', 'Providence', 'RI', '02912', '6593482691', 'M'],
    ['5', 'Stan', 'P', 'Davis', '1958-12-30', '4271 12th St.', 'Atlanta', 'GA', '30339', '4049814933', 'M']
]
PATIENT = pd.DataFrame(patient_data, columns=['Pid', 'Fname', 'Minit', 'Lname', 'Bdate', 'Street', 'City', 'State', 'Zip', 'Phone', 'Sex'])
PATIENT['Bdate'] = pd.to_datetime(PATIENT['Bdate'])

# VISIT table
visit_data = [
    ['1', '10001', '2016-01-09', 'JOHNSON', 'I50.9', 'Heart failure, unspecified', 'I10', 'Essential (primary) hypertension'],
    ['1', '10002', '2016-01-17', 'JOHNSON', 'I50.9', 'Heart failure, unspecified', 'I10', 'Essential (primary) hypertension'],
    ['2', '10003', '2016-01-15', 'WU', 'I20.9', 'Angina pectoris, unspecified', 'E11.9', 'Type 2 diabetes mellitus without complications'],
    ['3', '10004', '2016-02-01', 'JOHNSON', 'I10', 'Essential (primary) hypertension', '', ''],
    ['4', '10005', '2016-02-27', 'WU', 'I27.0', 'Primary pulmonary hypertension', 'I50.9', 'Heart failure, unspecified'],
    ['5', '10006', '2016-03-01', 'WU', 'I50.9', 'Heart failure, unspecified', 'E11.9', 'Type 2 diabetes mellitus without complications']
]
VISIT = pd.DataFrame(visit_data, columns=['Pid', 'Visit_id', 'Visit_date', 'Attending_md', 'Pri_dx_icd', 'Pri_dx_name', 'Sec_dx_icd', 'Sec_dx_name'])
VISIT['Visit_date'] = pd.to_datetime(VISIT['Visit_date'])

# MEDICATIONS table
medications_data = [
    ['1', 'LISINOPRIL', '5 mg', 'bid', 'po', 'JOHNSON', '01/09/2016', '68180-513-01'],
    ['1', 'FUROSEMIDE', '20 mg', 'bid', 'po', 'JOHNSON', '01/09/2016', '50742-104-01'],
    ['2', 'NITROGLYCERIN', '0.4 mg', 'tid', 'sl', 'WU', '01/15/2016', '59762-3304-1'],
    ['2', 'METFORMIN', '500 mg', 'bid', 'po', 'WU', '01/15/2016', '65162-175-10'],
    ['2', 'ASPIRIN', '81 mg', 'qdaily', 'po', 'WU', '01/15/2016', '63981-563-51'],
    ['2', 'METOPROLOL TARTRATE', '25 mg', 'bid', 'po', 'WU', '01/15/2016', '62332-112-31'],
    ['3', 'VALSARTAN HCTZ', '160/12.5 mg', 'qdaily', 'po', 'JOHNSON', '02/01/2016', '51655-950-52'],
    ['4', 'DILTIAZEM HYDROCHOLORIDE', '300 mg', 'qdaily', 'po', 'WU', '02/27/2016', '52544-693-19'],
    ['4', 'LISINOPRIL', '10 mg', 'bid', 'po', 'WU', '02/27/2016', '68180-514-01'],
    ['4', 'FUROSEMIDE', '40 mg', 'bid', 'po', 'WU', '02/27/2016', '68788-1966-1'],
    ['5', 'LISINOPRIL', '5 mg', 'bid', 'po', 'WU', '03/01/2016', '68180-513-01'],
    ['5', 'FUROSEMIDE', '20 mg', 'bid', 'po', 'WU', '03/01/2016', '50742-104-01'],
    ['5', 'METFORMIN', '500 mg', 'bid', 'po', 'WU', '03/01/2016', '65162-175-10']
]
MEDICATIONS = pd.DataFrame(medications_data, columns=['Pid', 'Rx_name', 'Rx_dose', 'Rx_freq', 'Rx_route', 'Prescribing_md', 'Rx_date', 'Rx_ndc'])
MEDICATIONS['Rx_date'] = pd.to_datetime(MEDICATIONS['Rx_date'])

# LABS table
labs_data = [
    ['1', 'Natriuretic peptide B', 'BNP', '42637-9', '350', 'JOHNSON', '2016-01-09'],
    ['2', 'Natriuretic peptide B', 'BNP', '42637-9', '100', 'WU', '2016-01-15'],
    ['2', 'Glucose', 'GLU', '2345-7', '225', 'WU', '2016-01-15'],
    ['2', 'Troponin I', 'TROP', '10839-9', '<0.004', 'WU', '2016-01-15'],
    ['4', 'Natriuretic peptide B', 'BNP', '42637-9', '1000', 'WU', '2016-02-27'],
    ['5', 'Natriuretic peptide B', 'BNP', '42637-9', '400', 'WU', '2016-03-01'],
    ['5', 'Glucose', 'GLU', '2345-7', '318', 'WU', '2016-03-01']
]
LABS = pd.DataFrame(labs_data, columns=['Pid', 'Lab_name', 'Lab_abbrev', 'Lab_loinc', 'Lab_value', 'Ordering_md', 'Lab_date'])
LABS['Lab_date'] = pd.to_datetime(LABS['Lab_date'])

# VITALS table
vitals_data = [
    ['1', '10001', 70, 188.4, 98.6, 95, 18, 154, 94, 97],
    ['1', '10002', 70, 188.4, 99.1, 85, 17, 157, 96, 100],
    ['2', '10003', 63, 130.2, 98.7, 82, 16, 120, 81, 100],
    ['3', '10004', 65, 120.0, None, 100, 19, 161, 100, 98],
    ['4', '10005', 66, 211.4, 98.2, 95, 19, 143, 84, 93],
    ['5', '10006', 69, 150.0, 97.6, 77, 18, 130, 86, 99]
]
VITALS = pd.DataFrame(vitals_data, columns=['Pid', 'Visit_id', 'Height_in', 'Weight_lb', 'Temp_f', 'Pulse', 'Resp_rate', 'Bp_syst', 'Bp_diast', 'SpO2'])

# MORT table
mort_data = [
    ['1', '2016-05-15'],
    ['4', '2016-06-08']
]
MORT = pd.DataFrame(mort_data, columns=['Pid', 'Mortality_date'])
MORT['Mortality_date'] = pd.to_datetime(MORT['Mortality_date'])

In [ ]:
PATIENT #similar to select * from PATIENT

,Pid,Fname,Minit,Lname,Bdate,Street,City,State,Zip,Phone,Sex
0,1,John,A,Smith,1952-01-01,1206 Fox Hollow Rd.,Pittsburgh,PA,15213,6789871234,M
1,2,Candice,P,Jones,1978-02-03,1429 Orlyn Dr.,Los Angeles,CA,90024,3107381419,F
2,3,Regina,H,Wilson,1985-04-23,765 Chestnut Ln.,Albany,NY,12065,5184590206,F
3,4,Harold,,Lee,1966-11-15,2928 Policy St.,Providence,RI,02912,6593482691,M
4,5,Stan,P,Davis,1958-12-30,4271 12th St.,Atlanta,GA,30339,4049814933,M

In [ ]:
PATIENT.head(1) #similar to LIMIT 1 in SQL
#can use tail() to see the last rows

,Pid,Fname,Minit,Lname,Bdate,Street,City,State,Zip,Phone,Sex
0,1,John,A,Smith,1952-01-01,1206 Fox Hollow Rd.,Pittsburgh,PA,15213,6789871234,M

In [13]:
PATIENT[['Pid', 'Fname', 'Lname']].head(3) #select specific columns, limit to 3 rows
#similar to SELECT Pid, Fname, Lname FROM PATIENT

  Pid    Fname   Lname
0   1     John   Smith
1   2  Candice   Jones
2   3   Regina  Wilson

In [ ]:
PATIENT[PATIENT['State'] == 'RI'] #similar to WHERE State = 'RI'

PATIENT[PATIENT['State'] == 'RI'].head() #limit to first 5 rows

,Pid,Fname,Minit,Lname,Bdate,Street,City,State,Zip,Phone,Sex
3,4,Harold,,Lee,1966-11-15,2928 Policy St.,Providence,RI,02912,6593482691,M

In [15]:
PATIENT.shape #gives number of rows and columns

(5, 11)

In [ ]:
len(PATIENT) #gives number of rows
# PATIENT.counts() gives number of non-null values in each column
# PATIENT.size gives total number of elements (rows * columns)
# these 3 are similar to SQL functions COUNT(), COUNT(column), and COUNT(*)

5

In [21]:
new_df_inner = pd.merge(PATIENT, MORT, on='Pid', how='inner') #inner join
#similar to SELECT * FROM PATIENT INNER JOIN MORT ON PATIENT.Pid = MORT.Pid
new_df_inner

,Pid,Fname,Minit,Lname,Bdate,Street,City,State,Zip,Phone,Sex,Mortality_date
0,1,John,A,Smith,1952-01-01,1206 Fox Hollow Rd.,Pittsburgh,PA,15213,6789871234,M,2016-05-15
1,4,Harold,,Lee,1966-11-15,2928 Policy St.,Providence,RI,02912,6593482691,M,2016-06-08

In [ ]:
new_df_left = pd.merge(PATIENT, MORT, on='Pid', how='left') #left join
#similar to SELECT * FROM PATIENT LEFT JOIN MORT ON PATIENT.Pid = MORT.Pid
new_df_left

,Pid,Fname,Minit,Lname,Bdate,Street,City,State,Zip,Phone,Sex,Mortality_date
0,1,John,A,Smith,1952-01-01,1206 Fox Hollow Rd.,Pittsburgh,PA,15213,6789871234,M,2016-05-15
1,2,Candice,P,Jones,1978-02-03,1429 Orlyn Dr.,Los Angeles,CA,90024,3107381419,F,NaT
2,3,Regina,H,Wilson,1985-04-23,765 Chestnut Ln.,Albany,NY,12065,5184590206,F,NaT
3,4,Harold,,Lee,1966-11-15,2928 Policy St.,Providence,RI,02912,6593482691,M,2016-06-08
4,5,Stan,P,Davis,1958-12-30,4271 12th St.,Atlanta,GA,30339,4049814933,M,NaT

In [ ]:
VISIT['Heart_failure'] = (VISIT['Pri_dx_id'].str.contains('Heart failure', case=False, na=False) | VISIT['Sec_dx_name'].str.contains('Heart failure', case=False, na=False))
# the na=False is to avoid getting NaN values when there are missing values in the column
#similar to CASE WHEN Pri_dx_name LIKE '%Heart failure%' OR Sec_dx_name LIKE '%Heart failure%' THEN True ELSE False END AS Heart_failure
# similar to SQL WHERE Pri_dx_name LIKE '%Heart failure%' OR Sec_dx_name LIKE '%Heart failure%'

In [23]:
VISIT

,Pid,Visit_id,Visit_date,Attending_md,Pri_dx_icd,Pri_dx_name,Sec_dx_icd,Sec_dx_name,Heart_failure
0,1,10001,2016-01-09,JOHNSON,I50.9,"Heart failure, unspecified",I10,Essential (primary) hypertension,True
1,1,10002,2016-01-17,JOHNSON,I50.9,"Heart failure, unspecified",I10,Essential (primary) hypertension,True
2,2,10003,2016-01-15,WU,I20.9,"Angina pectoris, unspecified",E11.9,Type 2 diabetes mellitus without complications,False
3,3,10004,2016-02-01,JOHNSON,I10,Essential (primary) hypertension,,,False
4,4,10005,2016-02-27,WU,I27.0,Primary pulmonary hypertension,I50.9,"Heart failure, unspecified",True
5,5,10006,2016-03-01,WU,I50.9,"Heart failure, unspecified",E11.9,Type 2 diabetes mellitus without complications,True

In [28]:
medications_count = MEDICATIONS.groupby('Pid')['Rx_name'].count().reset_index(name='Rx_count') #similar to SQL GROUP BY Pid and COUNT(*)
medications_count

  Pid  Rx_count
0   1         2
1   2         4
2   3         1
3   4         3
4   5         3

In [ ]:
medications_count_unique = MEDICATIONS.groupby('Pid')['Rx_name'].nunique().reset_index(name='Unique_Rx_count').sort_values(by='Unique_Rx_count', ascending=True) #similar to SQL GROUP BY Pid and COUNT(DISTINCT Rx_name), ascending order true = smallest to largest
medications_count_unique

  Pid  Unique_Rx_count
2   3                1
0   1                2
3   4                3
4   5                3
1   2                4

In [30]:
def temp_f_to_c(temp_f):
    return (temp_f - 32) * 5.0/9.0

In [31]:
temp_f_to_c(49)

9.444444444444445

In [32]:
#test loop function
temp_list_f = [32, 49, 68, 75, 100, 212]
for temp in temp_list_f:
    print(f"{temp} F = {temp_f_to_c(temp):.2f} C")

32 F = 0.00 C
49 F = 9.44 C
68 F = 20.00 C
75 F = 23.89 C
100 F = 37.78 C
212 F = 100.00 C